ErpTest/src/Documents/пкОперацииСТехникой/пкОперацииСТехникой.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>пкОперацииСТехникой</name>
  <registerRecords>InformationRegister.пкСтатусыТехники</registerRecords>
  <registerRecords>InformationRegister.пкСостояниеТехники</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.пкВидыОперацийСТехникой</types>
    </type>
  </attributes>
  <attributes>
    <name>Техника</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Местонахождения</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.СМ_ОбъектыСтроительства</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

ErpTest/src/InformationRegisters/пкСостояниеТехники/пкСостояниеТехники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>пкСостояниеТехники</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.пкПоказателиСостоянияТехники</types>
    </type>
  </resources>
  <dimensions>
    <name>Техника</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.пкПоказателиСостоянияТехники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/InformationRegisters/пкСтатусыТехники/пкСтатусыТехники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>пкСтатусыТехники</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.пкСтатусыТехники</types>
    </type>
  </resources>
  <resources>
    <name>ПланируемаяДатаЗавершения</name>
    <comment>Планируемая дата перехода в следующий статус (планируемая дата доставки, планируемая дата окончания ремонта)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаявкаНаАрендуТехники</name>
    <type>
      <types>DocumentRef.пкЗаявкаНаАрендуТехники</types>
    </type>
  </resources>
  <resources>
    <name>ЗаданиеНаПеревозку</name>
    <type>
      <types>DocumentRef.пкЗаданиеНаПеревозку</types>
    </type>
  </resources>
  <dimensions>
    <name>Техника</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/InformationRegisters/пкМестонахожденияПультовДляПодъемников/пкМестонахожденияПультовДляПодъемников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>пкМестонахожденияПультовДляПодъемников</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.пкСтатусСостоянияПульта</types>
    </type>
  </resources>
  <resources>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
      <types>CatalogRef.Склады</types>
    </type>
  </resources>
  <resources>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.СкладскиеЯчейки</types>
      <types>CatalogRef.СМ_ОбъектыСтроительства</types>
    </type>
  </resources>
  <dimensions>
    <name>Пульт</name>
    <type>
      <types>CatalogRef.пкПультыДляПодъемников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/Enums/пкВидыОперацийСТехникой/пкВидыОперацийСТехникой.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>пкВидыОперацийСТехникой</name>
  <enumValues>
    <name>Поступление</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>Продажа</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Enums/пкСтатусыТехники/пкСтатусыТехники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>пкСтатусыТехники</name>
  <enumValues>
    <name>НаБазе</name>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>ВПути</name>
  </enumValues>
  <enumValues>
    <name>ВАренде</name>
  </enumValues>
  <enumValues>
    <name>КВозврату</name>
  </enumValues>
  <enumValues>
    <name>Недоступен</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/ChartsOfCharacteristicTypes/пкПоказателиСостоянияТехники/пкПоказателиСостоянияТехники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>пкПоказателиСостоянияТехники</name>
  <type>
    <types>CatalogRef.СтруктураПредприятия</types>
    <types>String</types>
    <types>Number</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.СМ_ОбъектыСтроительства</types>
    <numberQualifiers>
      <precision>10</precision>
    </numberQualifiers>
    <stringQualifiers>
      <length>10</length>
    </stringQualifiers>
  </type>
  <predefined>
    <items>
      <name>Местонахождения</name>
      <description>Местонахождения</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.СМ_ОбъектыСтроительства</types>
      </type>
    </items>
    <items>
      <name>Моточасы</name>
      <description>Моточасы</description>
      <code>000000003</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>Подразделение</name>
      <description>Подразделение</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </items>
    <items>
      <name>ТемператураЗамерзанияОхлаждающейЖидкости</name>
      <description>Температура замерзания ох</description>
      <code>000000004</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

ErpTest/src/Documents/пкОперацииСТехникой/ManagerModule.bsl
#Область Отчеты

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт

	ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
 
КонецПроцедуры

#КонецОбласти

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Добавляет команду создания справочника "Договоры лизинга".
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	//МетаданныеСправочника = Метаданные.Справочники.ДоговорыЛизинга;
	//
	//Если ПравоДоступа("Добавление", МетаданныеСправочника) Тогда
	//	КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
	//	КомандаСоздатьНаОсновании.Менеджер = МетаданныеСправочника.ПолноеИмя();
	//	КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(МетаданныеСправочника);
	//	
	//	Возврат КомандаСоздатьНаОсновании;
	//	
	//КонецЕсли;
	//
	//Возврат Неопределено;
	
КонецФункции

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	СозданиеНаОснованииПереопределяемый.ДобавитьКомандуСоздатьНаОснованииБизнесПроцессЗадание(КомандыСозданияНаОсновании);
	
КонецПроцедуры

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов


#Область Проведение

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт

	ИсточникиДанных = Новый Соответствие;

	Возврат ИсточникиДанных; 

КонецФункции

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт

	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаТаблицаСостояниеТехники(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаСтатусыТехники(Запрос, ТекстыЗапроса, Регистры);
    
	ПроведениеСерверУТ.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
    
	Запрос.Текст = 
	"ВЫБРАТЬ
    |   ДанныеШапки.Дата КАК Период,
    |   ДанныеШапки.Ссылка КАК ОперацииСТехникой
    |ИЗ
    |   Документ.пкОперацииСТехникой КАК ДанныеШапки
    |ГДЕ
    |   ДанныеШапки.Ссылка = &Ссылка";
    
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Период",            Реквизиты.Период);
	Запрос.УстановитьПараметр("ОперацииСТехникой", Реквизиты.ОперацииСТехникой);
	
КонецПроцедуры

Процедура ОтразитьСостояниеТехники(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицапкСостояниеТехники;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияСостояниеТехники = Движения.пкСостояниеТехники;
	ДвиженияСостояниеТехники.Записывать = Истина;
	ДвиженияСостояниеТехники.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ОтразитьСтатусыТехники(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицапкСтатусыТехники;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияСтатусыТехники = Движения.пкСтатусыТехники;
	ДвиженияСтатусыТехники.Записывать = Истина;
	ДвиженияСтатусыТехники.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ОтразитьМестонахожденияПультов(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицапкМестонахожденияПультовДляПодъемников;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияМестонахожденияПультов = Движения.пкМестонахожденияПультовДляПодъемников;
	ДвиженияМестонахожденияПультов.Записывать = Истина;
	ДвиженияМестонахожденияПультов.Загрузить(Таблица);
	
КонецПроцедуры

Функция ТекстЗапросаТаблицаСостояниеТехники(Запрос, ТекстыЗапроса, Регистры)
    
    ИмяРегистра = "пкСостояниеТехники";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса =
    "ВЫБРАТЬ
    |   пкОперацииСТехникой.Дата КАК Период,
    |   ЗНАЧЕНИЕ(ПланВидовХарактеристик.пкПоказателиСостоянияТехники.Подразделение) КАК Показатель,
    |   пкОперацииСТехникой.Техника,
    |   пкОперацииСТехникой.Подразделение КАК Значение
    |ИЗ
    |   Документ.пкОперацииСТехникой КАК пкОперацииСТехникой
    |ГДЕ
    |   (пкОперацииСТехникой.ВидОперации = ЗНАЧЕНИЕ(Перечисление.пкВидыОперацийСТехникой.Поступление)
    |           ИЛИ пкОперацииСТехникой.ВидОперации = ЗНАЧЕНИЕ(Перечисление.пкВидыОперацийСТехникой.Перемещение))
    |   И пкОперацииСТехникой.Ссылка = &Ссылка
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   пкОперацииСТехникой.Дата,
    |   ЗНАЧЕНИЕ(ПланВидовХарактеристик.пкПоказателиСостоянияТехники.Местонахождения),
    |   пкОперацииСТехникой.Техника,
    |   пкОперацииСТехникой.Местонахождения
    |ИЗ
    |   Документ.пкОперацииСТехникой КАК пкОперацииСТехникой
    |ГДЕ
    |   (пкОперацииСТехникой.ВидОперации = ЗНАЧЕНИЕ(Перечисление.пкВидыОперацийСТехникой.Поступление)
    |           ИЛИ пкОперацииСТехникой.ВидОперации = ЗНАЧЕНИЕ(Перечисление.пкВидыОперацийСТехникой.Перемещение))
    |   И пкОперацииСТехникой.Ссылка = &Ссылка";
    
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаСтатусыТехники(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "пкСтатусыТехники";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса =
    "ВЫБРАТЬ
    |   пкОперацииСТехникой.Дата КАК Период,
    |   пкОперацииСТехникой.Техника,
    |   ВЫБОР
    |       КОГДА пкОперацииСТехникой.ВидОперации = ЗНАЧЕНИЕ(Перечисление.пкВидыОперацийСТехникой.Поступление)
    |           ТОГДА ЗНАЧЕНИЕ(Перечисление.пкСтатусыТехники.НаБазе)
    |       ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.пкСтатусыТехники.Недоступен)
    |   КОНЕЦ КАК Статус
    |ИЗ
    |   Документ.пкОперацииСТехникой КАК пкОперацииСТехникой
    |ГДЕ
    |   (пкОперацииСТехникой.ВидОперации = ЗНАЧЕНИЕ(Перечисление.пкВидыОперацийСТехникой.Поступление)
    |           ИЛИ пкОперацииСТехникой.ВидОперации = ЗНАЧЕНИЕ(Перечисление.пкВидыОперацийСТехникой.Списание)
    |           ИЛИ пкОперацииСТехникой.ВидОперации = ЗНАЧЕНИЕ(Перечисление.пкВидыОперацийСТехникой.Продажа))
    |   И пкОперацииСТехникой.Ссылка = &Ссылка"; 
    
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
				
КонецПроцедуры

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
КонецПроцедуры

#КонецОбласти


#Область ОбновлениеИнформационнойБазы

Функция ПолноеИмяОбъекта()
	Возврат "Документ.пкОперацииСТехникой";
КонецФункции

Функция МетаданныеДокумента() Экспорт
	
	СтруктураОбъекта = НаправленияДеятельностиСервер.СтруктураОбъекта();
	СтруктураОбъекта.ЭтоИсточникПотребности = Истина;
	СтруктураОбъекта.ЕстьНазначениеВТЧ = Ложь;
	Возврат СтруктураОбъекта;
	
КонецФункции

#КонецОбласти
